Core/src/InformationRegisters/ТоварыПоставщиковВТТН/ТоварыПоставщиковВТТН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТоварыПоставщиковВТТН</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>W_NAME</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>BAR_CODE</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>UNIT_TXT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/ТоварыПоставщиковВТТН/ManagerModule.bsl
Процедура ЗаполнитьДанныеПоНоменклатуреПоставщикаНД(СтрокаТЗ) Экспорт 
		
	НаборЗаписей = РегистрыСведений.ТоварыПоставщиковВТТН.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.W_NAME.Установить	(СтрокаТЗ.GOODS_NAME);
	НаборЗаписей.Отбор.BAR_CODE.Установить	(СтрокаТЗ.BARCODE);
	НаборЗаписей.Отбор.UNIT_TXT.Установить	(СтрокаТЗ.UNIT_TXT);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		Запись = НаборЗаписей[0];
		СтрокаТЗ.Номенклатура		= Запись.Номенклатура;
		СтрокаТЗ.Характеристика		= Запись.Характеристика;
		СтрокаТЗ.ЕдиницаИзмерения	= Запись.ЕдиницаИзмерения;
	Иначе
		СтрокаТЗ.Номенклатура		= Неопределено;
		СтрокаТЗ.Характеристика		= Неопределено;
		СтрокаТЗ.ЕдиницаИзмерения	= Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПоНоменклатуреПоставщика(СтрокаТЗ) Экспорт 
		
	НаборЗаписей = РегистрыСведений.ТоварыПоставщиковВТТН.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.W_NAME.Установить	(СтрокаТЗ.W_NAME);
	НаборЗаписей.Отбор.BAR_CODE.Установить	(СтрокаТЗ.BAR_CODE);
	НаборЗаписей.Отбор.UNIT_TXT.Установить	(СтрокаТЗ.UNIT_TXT);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		Запись = НаборЗаписей[0];
		СтрокаТЗ.Номенклатура		= Запись.Номенклатура;
		СтрокаТЗ.Характеристика		= Запись.Характеристика;
		СтрокаТЗ.ЕдиницаИзмерения	= Запись.ЕдиницаИзмерения;
	Иначе
		СтрокаТЗ.Номенклатура		= Неопределено;
		СтрокаТЗ.Характеристика		= Неопределено;
		СтрокаТЗ.ЕдиницаИзмерения	= Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВРегистрТоварыПоставщиков(СтрокаТЗ) Экспорт

	НаборЗаписей = РегистрыСведений.ТоварыПоставщиковВТТН.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.W_NAME.Установить	(СтрокаТЗ.W_NAME);
	НаборЗаписей.Отбор.BAR_CODE.Установить	(СтрокаТЗ.BAR_CODE);
	НаборЗаписей.Отбор.UNIT_TXT.Установить	(СтрокаТЗ.UNIT_TXT);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запись = РегистрыСведений.ТоварыПоставщиковВТТН.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, СтрокаТЗ);
	Запись.Записать();	
	
	//RS.
	//Запись.W_NAME		= СтрокаТЗ.W_NAME;
	//Запись.BAR_CODE		= СтрокаТЗ.BAR_CODE;	
	//Запись.UNIT_TXT		= СтрокаТЗ.UNIT_TXT;
	//
	////1С.
	//Запись.Номенклатура		= СтрокаТЗ.Номенклатура;
	//Запись.Характеристика	= СтрокаТЗ.Характеристика;
	//Запись.ЕдиницаИзмерения	= СтрокаТЗ.ЕдиницаИзмерения;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВРегистрТоварыПоставщиковНД(СтрокаТЗ) Экспорт

	НаборЗаписей = РегистрыСведений.ТоварыПоставщиковВТТН.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.W_NAME.Установить	(СтрокаТЗ.GOODS_NAME);
	НаборЗаписей.Отбор.BAR_CODE.Установить	(СтрокаТЗ.BARCODE);
	НаборЗаписей.Отбор.UNIT_TXT.Установить	(СтрокаТЗ.UNIT_TXT);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запись = РегистрыСведений.ТоварыПоставщиковВТТН.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, СтрокаТЗ);	
	Запись.W_NAME		= СтрокаТЗ.GOODS_NAME;
	Запись.BAR_CODE		= СтрокаТЗ.BARCODE;	
	Запись.UNIT_TXT		= СтрокаТЗ.UNIT_TXT;
	Запись.Записать();	
	
	//RS.
	//Запись.W_NAME		= СтрокаТЗ.W_NAME;
	//Запись.BAR_CODE		= СтрокаТЗ.BAR_CODE;	
	//Запись.UNIT_TXT		= СтрокаТЗ.UNIT_TXT;
	//
	////1С.
	//Запись.Номенклатура		= СтрокаТЗ.Номенклатура;
	//Запись.Характеристика	= СтрокаТЗ.Характеристика;
	//Запись.ЕдиницаИзмерения	= СтрокаТЗ.ЕдиницаИзмерения;
	
КонецПроцедуры
